CanEnableTemporaryViewPropertiesMode Method
 Indicates if Temporary View Properties mode can be applied for view in current state.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool CanEnableTemporaryViewPropertiesMode()
  Visual Basic
Public Function CanEnableTemporaryViewPropertiesMode As Boolean
  Visual C++
public:
bool CanEnableTemporaryViewPropertiesMode()
 Return Value
 True if view can use Temporary View Properties mode in current state.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →